Repository: 84000/data-translation-memory
Catalog: toh114-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Homage to all buddhas and bodhisattvas! Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ན།
en: The Blessed One was dwelling in the Bamboo Grove, in the Kalanda­kanivāpa near Rājagṛha,

source: དགེ་སློང་ལྔ་བརྒྱ་ཐམ་པའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཉིས་བརྒྱ་ཐམས་ཅད་ཀྱང་གཟུངས་ཐོབ་པ།
en: together with a great saṅgha of five hundred monks and with twelve hundred bodhisattvas, all of whom had obtained dhāraṇīs.

source: ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ། སྤྱོད་ཡུལ་ཆགས་པ་མེད་པ།
en: They had unimpeded wisdom and were unhindered in their sphere of activity.

source: ཐབས་མཁས་པ། ཁམས་གསུམ་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ།
en: They were skilled in means, had developed equanimity toward everything in the three realms,

source: ཕན་པ་དང་སྙིང་རྗེའི་ལྷག་པའི་བསམ་པ་ལ་ཞུགས་པ།
en: and possessed an altruistic mindset of compassion and benevolence.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འབེལ་བའི་གཏམ་འདྲི་བ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: All of them were there to request Dharma teachings from the Thus-Gone One.

source: དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཉིས་བརྒྱ་དང་།
en: The twelve hundred bodhisattvas in attendance included

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་།
en: the bodhisattva great being Maitreya,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་ཏུ་བརྩོན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཉམ་པ་ཉིད་ལ་གནས་པ་དང་།
en: the bodhisattva great being Nityodyukta, the bodhisattva great being Sama­tā­vihā­rin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་གཡོ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བཟང་པོ་དང་།
en: the bodhisattva great being Aniñjya, the bodhisattva great being Sumati,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་མཐའ་ཡས་དང་།
en: the bodhisattva great being Mahāmati, the bodhisattva great being Ananta­prati­bhāna,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་གནོན་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་།
en: the bodhisattva great being Suvi­krānta­mati, and the bodhisattva great being Avaloki­teśvara.

source: ཏུ་བཞུགས་ཏེ།
en: Also present were

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་དང་། ཀླུའི་རྒྱལ་པོ་རྣམས་དང་།
en: Śakra, Brahmā, the guardians of the world, the nāga kings,

source: སྲིན་པོའི་བདག་པོ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་མོ་སུམ་བརྒྱ་དང་།
en: the lords of the rākṣasas, and three hundred yakṣiṇīs.

source: གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་པ་དྲུག་སྟོང་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་བདུན་དང་ཐབས་ཅིག་
en: There were also six thousand caraka, parivrājaka, and nirgrantha non-Buddhists, as well as the seven lords of the garuḍas.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་བསྐོར་བ་བྱས་ནས།
en: The whole assembly, while circumambulating the Thus-Gone One,

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ལྷའི་མེ་ཏོག་གི་ཆར་མངོན་པར་ཕབ་བོ། །ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །ལྷའི་སིལ་སྙན་དང་ཕེག་རྡོབ་པ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་བསྒྲགས་སོ། །
en: worshiped him by scattering a rain of celestial flowers and sandalwood powder, and playing divine cymbals and drums.

source: གང་དག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་མངོན་པར་དད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With manifest faith in the teaching of the Thus-Gone One, they exclaimed,

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ། །
en: “Blessed One, excellent, excellent!

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་བགྱིད་པ་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་སྟེ་
en: Blessed One, the teaching of the Thus-Gone One that extinguishes all disturbing emotions is a great miracle!

source: ལེགས་སོ་ལེགས་སོ། །
en: It is excellent, excellent!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་ཚེ་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་འཇོམས་པ་རྡུལ་མེད་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས།
en: At that moment the Blessed One entered the absorption known as the stainless victory banner that completely subdues all disturbing emotions

source: ཏིང་ངེ་འཛིན་དེའི་མཐུས་ས་ཆེན་པོ་འདི་མཐོ་བ་དང་དམའ་བར་བྱས་ཏེ། འགུལ། རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ།
en: Through the power of that absorption, the earth shook violently, causing it to rise and sink. It quivered, trembled, and quaked;

source: གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག །
en: wobbled, rocked, and swayed; vibrated, shuddered, and reeled;

source: འཁྲུགས། རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས། འུར་འུར། རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར། ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །
en: convulsed, rattled, and shook; clattered, rattled, and clanged; and boomed, thundered, and roared.

source: ལྷའི་ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་ཡང་བབ་བོ། །ལྷའི་མེ་ཏོག་གི་ཆར་ཡང་བབ་བོ། །ལྷའི་འོད་ཀྱི་སྣང་བ་ཡང་བྱུང་ངོ་།
en: A rain of sandalwood powder and celestial flowers fell from the sky, and divine light shone throughout the world.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སེམས་ཅན་གང་སུ་དག་ངན་སོང་དུ་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ངན་སོང་རྣམས་ལས་ཡོངས་སུ་གྲོལ་བར་གྱུར་ཏོ། །
en: All the beings in this great trichiliocosm who had taken birth in the lower realms were instantly freed.

source: ལྷའི་དབང་པོ་དང་། ཀླུའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། སྲིན་པོའི་དབང་པོ་དང་། མིའི་དབང་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་གནས་རྣམས་ཀྱང་སྣང་བར་གྱུར་ཏོ། །
en: The homes of the lords of the gods, nāgas, yakṣas, rākṣasas, and humans were illuminated.

source: ལྷའི་སིལ་སྙན་གྱི་སྒྲ་དག་ཀྱང་གྲག་གོ། །
en: The sound of celestial cymbals resounded,

source: ལྷའི་འོད་དག་ཀྱང་སྣང་བར་གྱུར་ཏོ། །ལྷའི་སྤོས་ཀྱི་ངད་ཀྱང་ལྡང་བར་གྱུར་ཏོ། །
en: and divine lights and fragrances manifested everywhere.

source: དེ་ནས་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོ་འཕྲུལ་ཆེན་པོ་དེ་མཐོང་ནས་ཡ་མཚན་དུ་གྱུར་ཏེ་འདི་སྙམ་དུ་སེམས་སོ། །
en: Everyone was amazed at the sight of this great miraculous display and wondered,

source: གནས་འདི་དག་སྣང་བར་གྱུར་པ་འདི་དང་།
en: “Whose power is causing this illumination of our homes,

source: ཆོ་འཕྲུལ་ཆེན་པོ་སྣང་བར་གྱུར་པ་འདི་དང་། ས་ཆེན་པོ་གཡོས་པ་འདི་དང་། མེ་ཏོག་གི་ཆར་ཆེན་པོ་བབ་པ་འདི་སུའི་མཐུ་ཡིན། །
en: the manifestation of this great miracle, these earthquakes, and this great rain of flowers?

source: སུའི་བྱིན་གྱིས་བརླབས་ཡིན་ཞིག་གུ་སྙམ་ནས།
en: Whose blessings are causing all of this?”

source: དེ་དག་ཐང་ཅིག་ཅང་མི་ཟེར་སེམས་ནས་གཅིག་ལ་གཅིག་འདི་སྐད་དུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུ་ཡིན་ནོ། །
en: Having reflected on this silently for a moment, they said to each other, “This is the power of the Thus-Gone One!

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཡིན་ནོ་ཞེས་སྨྲས་སོ། །
en: These are the miracles of the Thus-Gone One!”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ་དང་།
en: At that time the Four Great Kings thought, “Let us go to where the Blessed One resides so we can meet,

source: ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། ཆོས་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་འདོང་གོར་མ་ཆག་སྙམ་མོ། །
en: pay homage to, and worship the Thus-Gone One, and listen to the Dharma.”

source: དེ་ནས་ལྷའི་དབང་པོ་དང་། ཀླུའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། སྲིན་པོའི་དབང་པོ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་
en: So the lords of the gods, nāgas, yakṣas, and rākṣasas, all these powerful beings endowed with great supernatural powers,

source: འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: then proceeded to the Bamboo Grove, in the Kalanda­kanivāpa where the Blessed One was residing, carrying

source: ལྷའི་མེ་ཏོག་ཨུད་པལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། དྲི་མཆོག་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དག་ཁྱེར་ནས་
en: with them blue lotus flowers, pink lotus flowers, water lilies, and white lotus flowers, as well as jasmine, mandārava, and mahāmandārava flowers.

source: བཅོམ་ལྡན་འདས་ལ་མངོན་པར་མཆོད་དེ་ཕྱག་བྱས་སོ། །
en: Once there, they worshiped the Blessed One and paid homage to him.

source: མེ་ཏོག་གི་ཆར་ཆེན་པོ་དེས་ཀྱང་ས་ཆེན་པོ་འདི་པུས་མོ་ནུབ་ཙམ་དུ་ཁྱབ་པར་འདུག་གོ། །
en: Their downpour of flowers covered the wide earth up to knee height.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: All the bodhisattva great beings then circumambulated the Blessed One three times and sat to one side to listen to the Dharma.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དུ་མས་བསྐོར་ཅིང་།
en: The bodhisattva great being Vajrapāṇi was surrounded by millions of bodhisattvas

source: ལྷ་བྱེ་བ་ཕྲག་དུ་མས་བསྐོར་ཏེ། རིག་སྔགས་འཆང་བརྒྱ་ཕྲག་དུ་མས་མདུན་དུ་བདར་བས་རྫུ་འཕྲུལ་དང་མཐུ་ཆེན་པོ་དང་།
en: and millions of gods, and there were many hundreds of vidyādharas present before him.

source: བཀོད་པ་ཆེན་པོ་དང་།
en: Through the great power of their supernatural abilities,

source: དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་བཅས་པ་ལ་མངོན་པར་མཆོད་དོ། །
en: they worshiped the Thus-Gone One, his saṅgha of monks, and the gathering of bodhisattvas

source: མེ་ཏོག་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བདུག་པ་དང་། རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་ཆེན་པོས་
en: with a great array of flowers, perfumes, flower garlands, incense, cymbals, and great drums.

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བཀོད་པའི་རྒྱལ་པོས་ལྷའི་བཀོད་པ་དང་། བཀོད་པའི་མཐུ་དང་། མེ་ཏོག་གི་ཆར་ཆེན་པོས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཆེན་པོ་བྱས་སོ། །
en: Then the bodhisattva Vyūharāja made offerings to the Thus-Gone One in the form of displays both mighty and divine, as well as a great rain of flowers.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་འདུས་པ་ཆེན་པོ་དེ་མཐོང་ནས། ཆོས་ཀྱི་འབེལ་བའི་གཏམ་འདོད་པར་གྱུར་ཏོ། །
en: Seeing that vast assembly, the bodhisattva great beings longed for a Dharma discourse.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཐུགས་ཀྱིས་མཁྱེན་ནས། བྱང་ཆུབ་སེམས་དཔའ་བཀོད་པའི་རྒྱལ་པོ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: In his mind, the Blessed One knew the bodhisattvas’ wish, and so spoke to the bodhisattva Vyūharāja, saying,

source: རིགས་ཀྱི་བུ་སོང་ལ་ས་ཆེན་པོ་འདི་ལྟོས་ཤིག །
en: “Noble son, go and survey the wide earth.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བཀོད་པའི་རྒྱལ་པོས་ས་ཆེན་པོ་བལྟས་སོ། །བལྟས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Vyūharāja surveyed the wide earth and replied,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ས་ཆེན་པོ་བལྟས་ལགས་ཏེ།
en: “Blessed One, I have surveyed the wide earth.

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བའི་འདུས་པ་ཆེན་པོ་མཛད་པ་མཐོང་ལགས་སོ། །
en: Blessed One, I see the great assembly you brought about for the happiness of all beings.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བཀོད་པའི་རྒྱལ་པོ་སྲོག་ཆགས་དྲུག་ཁྲི་བཞི་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དེང་ཁོ་ན་ལུང་བསྟན་པར་འགྱུར་རོ། །
en: “Vyūharāja,” declared the Blessed One, “on this very day the attainment of unsurpassed and perfect awakening will be prophesied for sixty-four thousand beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Vajrapāṇi then fell at the feet of the Blessed One and said,

source: བཅོམ་ལྡན་འདས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། མི་དང་། སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་མང་པོ་འདུས་ལགས་སོ། །
en: “Blessed One, many gods, nāgas, yakṣas, rākṣasas, humans, carakas, and parivrājakas have gathered here.

source: བདེ་བར་གཤེགས་པ་སེམས་ཅན་མང་པོ་འདུས་ལགས་སོ། །
en: Well-Gone One, many beings have gathered here.

source: བཅོམ་ལྡན་འདས་ཆོས་མཉན་པའི་དུས་ནི་འདི་ལགས་སོ། །
en: Blessed One, this is the time for hearing the Dharma.

source: བདེ་བར་གཤེགས་པ་ཆོས་མཉན་པའི་དུས་ནི་འདི་ལགས་སོ། །
en: Well-Gone One, this is the time for hearing the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་ནས།
en: But the Blessed One remained silent.

source: བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་བཏབ་སྟེ།
en: So the bodhisattva Vajrapāṇi then supplicated the Thus-Gone One a second time, and a third time:

source: བཅོམ་ལྡན་འདས་བསྟན་དུ་གསོལ། བདེ་བར་གཤེགས་པ་བསྟན་དུ་གསོལ།
en: “Blessed One, I request you to teach the Dharma! Well-Gone One, I request you to teach the Dharma!

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་གྲུབ་པར་མཛད་དུ་གསོལ།
en: I request you to fulfill the aspirations of all beings!

source: བཅོམ་ལྡན་འདས་འགྱོད་པ་བསལ་བ་དང་།
en: Blessed One, I request you to dispel their remorse!

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པ་དང་བདེ་བའི་སླད་དུ་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་མདོ། །
en: For the welfare and happiness of all beings, I request you to teach the sūtra called The King of the Array of All Dharma Qualities

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་བགྱིད་པ།
en: It extinguishes all disturbing emotions,

source: བདུད་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པ། སྡིག་པ་ཐམས་ཅད་ཟད་པར་བགྱིད་པ།
en: overcomes all demons, brings an end to all evil deeds,

source: སེམས་ཅན་མ་དད་པ་རྣམས་དད་པར་བགྱིད་པ། མུ་གེའི་གནོད་པ་ཞི་བར་བགྱིད་པ།
en: generates faith in those who lack faith, quells the torments caused by famines,

source: ནད་ཐམས་ཅད་ཞི་བར་བགྱིད་པ། དུས་མ་ལགས་པར་འཆི་བ་ཐམས་ཅད་ཟློག་པ།
en: cures all sicknesses, and wards off untimely death.

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་གློག་སྣང་བ་ལས་ཐོས་ནས།
en: The very moment I heard it from the Thus-Gone One Vidyuprabhāsa,

source: ཐོས་པའི་མོད་ལ་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་ཅིང་། ངན་སོང་ཐམས་ཅད་ཡང་དག་པར་ཆད་དེ།
en: all phenomena became immediately apparent to me, the gates to the lower realms closed completely,

source: ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ་གང་ལགས་པ་དེ་བསྟན་པར་གསོལ།
en: and all karmic obscurations were eliminated. Please teach this sūtra!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: But in response, the Blessed One told the bodhisattva great being Vajrapāṇi,

source: རིགས་ཀྱི་བུ་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་སེམས་ཅན་ངའི་བསྟན་པ་ལ་མ་དད་པ་དང་།
en: “Noble son, in the future there will be beings who have no faith in my teaching,

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་སྡེ་དག་ལ་མངོན་པར་མ་དད་ཅིང་ཡིད་མི་ཆེས་ལ།
en: who have no genuine faith or trust in the sūtras spoken by the Thus-Gone One.

source: ཚིག་འདི་སྐད་དུ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་སྡེ་མ་ཡིན་ནོ། །
en: They will claim, ‘This is not a sūtra taught by the Thus-Gone One,’

source: འདི་ལ་ནི་ལེགས་པར་བྱས་པ་དང་། ཉེས་པར་བྱས་པའི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཅི་ཡང་མེད་དོ་ཞེས་ཟེར་བ་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: or, ‘According to this teaching there is no karmic maturation of either good or bad actions.’

source: དེ་དག་ནི་ཆགས་པས་ཟིལ་གྱིས་ནོན་ནས། མཆོད་པ་ཡང་མངོན་པར་འདུ་བྱེད་པར་མི་འགྱུར་ལ། ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་མཆོད་པ་བྱེད་པར་མི་འགྱུར་ཏེ།
en: Overwhelmed by greed, they will not engage in activities of worship, not even toward those who teach the Dharma.

source: དེ་དག་ནི་ཚེ་འདི་ཉིད་ལ་ཡང་འཁྲུག་པ་མང་པོ་འབྱུང་བར་འགྱུར་ལ། ཕྱིས་ཀྱང་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་བཙོ་བར་འགྱུར་ཏེ།
en: They will experience many misfortunes in that very life and will burn in the hell realms in their future rebirths.

source: རིགས་ཀྱི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡབ་ཡུམ་དང་འདྲ་ལ། ལས་ཐམས་ཅད་ཟད་པར་བྱེད་པའི་མདོ་སྡེའི་རྒྱལ་པོ་ཆེན་པོ་མཉན་པའི་དུས་མ་ཡིན་ཏེ།
en: Noble son, this is not the time to hear this great king of sūtras that is like the father and mother of the thus-gone ones and that exhausts all karma.

source: གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དེ་དག་དང་།
en: Moreover, it might cause those non-Buddhist carakas and parivrājakas,

source: སེམས་ཅན་མང་པོ་གཞན་དག་ཀྱང་ངན་སོང་དུ་འགྲོ་བར་འོང་ངོ་། །
en: as well as many other beings, to be reborn in the lower realms.

source: རིགས་ཀྱི་བུ་དེ་དག་ནི་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ལ་དད་པར་མི་འགྱུར་ཏེ།
en: Noble son, they will not have faith in this king of sūtras.

source: འདོད་པས་ལྡོངས་པའི་ཡིད་ཀྱིས་ཁྱིམ་ཡོངས་སུ་སྐྱོང་བར་བྱེད་ཅིང་།
en: With their minds blinded by desire, they will be preoccupied with their households.

source: རྨོ་རྐོ་དང་། ཚོང་དང་། གཡུལ་འགྱེད་པ་དང་། འཐབ་པ་ལ་སྲེད་པར་འགྱུར་རོ། །
en: They will engage in farm work and business, fight battles, and crave conflict.

source: དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བརྒྱད་པོ་དག་ཏུ་བཙོ་བར་འགྱུར་རོ། །
en: After they die, they will burn in the eight great hells.”

source: དེ་ནས་དེའི་ཚེ་སྲོག་ཆགས་བརྒྱད་ཁྲི་སྟན་ལས་ལངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that moment, however, eighty thousand beings stood up, fell at the feet of the Blessed One, and said,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་དད་པར་བགྱིད་ལགས་སོ། །
en: “Blessed One, we will have faith in this sūtra.

source: མངོན་པར་མཆོད་པར་བགྱིད་ལགས་སོ། །རྒྱས་པར་ཡང་བགྱིད་ལགས་སོ། །
en: We will revere it and spread it.

source: འདྲི་བ་དང་། ཀློག་པ་དང་། ཉན་དུ་སྩལ་བ་དང་། འདོན་པ་ལ་སྤྲོ་བར་བགྱིད་ལགས་སོ། །
en: We will be eager to write it down, read it aloud, propagate it, and recite it.

source: སླད་ཀྱིས་ཆོས་མ་ལགས་པའི་དུས་དེ་ལ་བབ་ན། སྤྱོ་བ་དང་། བརྒྱད་བཀག་པ་དང་། བསྡིགས་པ་བཟོད་པར་བགྱིད་ལགས་སོ། །
en: Later on, when the Dharma has disappeared, we will bear criticism, intimidation, and abuse.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་བཀའ་དྲིན་གཟོ་བར་བགྱིད་ཀྱི། བཀའ་དྲིན་མི་གཟོ་བར་མི་བགྱིད་དེ། བདག་ཅག་སླད་ཀྱིས་འགྱོད་པར་འགྱུར་བར་མི་བགྱིད་ལགས་སོ། །
en: Blessed One, we will remember your kindness, and will not be ungrateful or have regrets later.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་མདོ་བསྟན་དུ་གསོལ།
en: Blessed One, please teach the sūtra called The King of the Array of All Dharma Qualities

source: འདི་ནི་སླད་མའི་དུས་སླད་མའི་ཚེ་དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་བགྱིད་པར་འགྱུར་བ་ལགས་སོ། །
en: In future times, this sūtra will perform the activity of the Thus-Gone One.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Vajrapāṇi then asked,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་བཤེས་གཉེན་ཇི་ལྟར་ཡོངས་སུ་བཙལ་བར་བགྱི།
en: “Blessed One, how should a bodhisattva great being search for a spiritual friend?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་
en: “Noble son,” answered the Blessed One, “a bodhisattva great being

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བར་བྱའོ།
en: who searches for a spiritual friend should possess these four qualities:

source: རྒྱུན་མི་འཆད་པར་དགེ་བའི་བཤེས་གཉེན་ལ་ལྟ་བར་འདོད་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་།
en: a wish to be continuously in the presence of a spiritual friend, ( ) a diligent nature,

source: བསམ་པ་ཡོངས་སུ་དག་པ་དང་། ཆོས་འདོད་པར་བྱས་ཏེ། །
en: a completely pure motivation, and (4) the wish to receive the Dharma.”

source: བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དགོན་པ་ན་གནས་པས་ཇི་ལྟར་བགྱི་ལགས།
en: “Blessed One,” continued the bodhisattva Vajrapāṇi, “how should a bodhisattva live in solitude?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: འདི་ལྟ་སྟེ། ཁྱིམ་ན་གནས་པ་ཡོངས་སུ་སྤང་བ་དང་། མི་དགེ་བའི་བཤེས་གཉེན་གྱི་འདུ་འཛི་ཡོངས་སུ་སྤང་བ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ། །
en: “That bodhisattva should avoid the householder life, avoid associating with non-spiritual friends, and give up all personal possessions.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being noble Avaloki­teśvara then said,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ངན་སོང་དུ་མཆི་བར་འགྱུར་བ་དེ་མ་མཐོང་སྟེ།
en: “Blessed One, I have never seen anyone reborn in the lower realms after hearing this Dharma teaching.

source: དེ་ནི་གནས་མ་མཆིས་སོ། །
en: In fact, that would be impossible.

source: བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པ་དང་། འདི་ལ་ཕྱག་འཚལ་བ་དེ་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ལགས་ན།
en: Blessed One, just listening to this Dharma teaching and paying homage to it is already a great miracle and a great wonder,

source: གང་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་།
en: not to mention the acts of writing this Dharma teaching down; commissioning it to be written; holding it; reading it aloud;

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བགྱིད་པ་དང་།
en: venerating it with parasols, victory banners, and flags;

source: ཆོས་སྨྲ་བ་དེ་ལ་ཡང་གོས་དང་། རྒྱན་རྣམས་ཀྱིས་མཆོད་པར་བགྱིད་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ།
en: or of offering clothes and ornaments to those who teach it!

source: དེ་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་ལགས་སོ། །
en: Such people are blessed by all the buddhas.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་ལུང་བསྟན་པ་ཁོ་ན་ལགས་སོ། །
en: The thus-gone ones have prophesied that they will be reborn in Sukhāvatī.

source: ཆོས་སྨྲ་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བ་ཁོ་ནར་བལྟ་བར་བགྱིའོ། །
en: Such Dharma teachers should be regarded as thus-gone ones themselves.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་ཏེ། ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent,” said the Blessed One. “Thus it is, noble son!

source: ཆོས་སྨྲ་བ་དེ་ལ་ནི་ངས་ཀྱང་མཆོད་པར་བྱའོ། །
en: I too will revere those who spread this Dharma teaching.

source: འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་ཡང་ལུང་བསྟན་པར་བྱའོ། །
en: And I prophesy that they will be reborn in Sukhāvatī.

source: གང་དེ་བཞིན་གཤེགས་པ་ལ་བླ་མའི་སྲི་ཞུ་བྱེད་ཅིང་མེ་ཏོག་དང་། བདུག་སྤོས་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་།
en: Those who revere the thus-gone ones and worship them with flowers, incense, perfumes, flower garlands,

source: བྱུག་པ་དང་། གོས་དང་། རྒྱན་རྣམས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་པ་དེ་ནི་དུས་མ་ཡིན་པར་འཆི་བས་འཆི་བར་མི་འགྱུར་རོ། །
en: ointments, cloths, ornaments, parasols, victory banners, and flags will not die an untimely death.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་འཇིགས་པ་ཡང་མེད། མུ་གེའི་གནོད་པའི་འཇིགས་པ་ཡང་མེད།
en: They will not fear enemy armies or the calamity of famines.

source: བུ་ལས་གྱུར་པའི་ཡིད་མི་བདེ་བ་ཡང་མེད། ཆུང་མ་ལས་གྱུར་པའི་ཡིད་མི་བདེ་བ་ཡང་མེད་ལ།
en: They will not be distressed over their children or their spouses,

source: བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: and all their aspirations will be completely fulfilled.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་འབྱུང་བ་དང་། མདོ་སྡེའི་རྒྱལ་པོ་འདི་ཐོས་པ་ནི་དཀའོ། །
en: Noble son, it is rare for thus-gone ones to appear and for this king of sūtras to be heard.

source: རིགས་ཀྱི་བུ་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ཁྱིམ་འམ།
en: Noble son, whether in a village, a city, a market, a house,

source: དགོན་པའི་གནས་གང་ལ་ལར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པའི་ས་ཕྱོགས་དེ་ནི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ།
en: or an isolated place, any place in which this Dharma teaching is heard will be kept under the care of the thus-gone ones.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: “Blessed One,” asked the bodhisattva Vajrapāṇi,

source: བཅོམ་ལྡན་འདས་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཅེས་བགྱི་བ་ཅིའི་སླད་དུ་དེ་སྐད་ཅེས་བགྱི་ལགས། བཀའ་སྩལ་པ། །
en: “why did Avaloki­teśvara receive the name ‘Avaloki­teśvara (The Lord Who Sees)’?”

source: གང་གི་ཕྱིར་འདི་ལྟར་འཇིག་རྟེན་ཐམས་ཅད་ལ་ལྟ་བར་བྱེད། རྟོག་པར་བྱེད། ཚིམ་པར་བྱེད། ཡོངས་སུ་སྐྱོང་བར་བྱེད། ཡང་དག་པར་དབུགས་འབྱིན་པར་བྱེད་ཅིང་།
en: “Because he sees and surveys the entire world; brings contentment, protection, and relief;

source: སྙིང་རྗེའི་སེམས་དང་། བདེ་བའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། སྙིང་བརྩེ་བའི་སེམས་དང་ལྡན་ལ།
en: has a compassionate, benevolent, loving, and affectionate mind;

source: བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས་ན་དེའི་ཕྱིར་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: and completely fulfills all aspirations, he is named ‘Avaloki­teśvara.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་གསོལ་པ།
en: The bodhisattva Vajrapāṇi then said,

source: བཅོམ་ལྡན་འདས་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མིང་ཙམ་ལ་རྟོག་པ་གང་ལགས་པ་དེ་ཡང་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ན།
en: “Blessed One, just to contemplate Avaloki­teśvara’s name completely fulfills all one’s aspirations,

source: གང་དག་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་མཆོད་པ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མངོན་པར་དད་པ་དང་།
en: not to mention worshiping the Thus-Gone One, or having faith in this Dharma teaching,
